-- Заполнение таблицы "Товар"
INSERT INTO product (description, cost, quantity)
VALUES
    ('Наушники', 1099.99, 50),
    ('Клавиатура', 2559.99, 25),
    ('Мышь компьютерная', 1119.99, 100),
    ('Блокнот', 254.99, 75),
    ('Ручка', 100.59, 200),
    ('Карандаш', 52.99, 80),
    ('Степлер', 219.99, 30),
    ('Стикеры', 89.99, 40),
    ('Монитор 32"', 15599.99, 15),
    ('Флэш-накопитель 32 ГБ', 1499.99, 60);

-- Заполнение таблицы "Покупатель"
INSERT INTO customer (name, surname)
VALUES
    ('Иван', 'Иванов'),
    ('Петр', 'Петров'),
    ('Анна', 'Сидорова'),
    ('Сергей', 'Кузнецов'),
    ('Елена', 'Смирнова'),
    ('Алексей', 'Новиков'),
    ('Мария', 'Васильева'),
    ('Дмитрий', 'Михайлов'),
    ('Ольга', 'Заплатина'),
    ('Андрей', 'Орлов');

-- Заполнение таблицы "Заказ"
INSERT INTO orders (product_id, customer_id, order_date, quantity)
VALUES
    (1, 1, '2023-04-01', 2),
    (2, 2, '2023-04-02', 1),
    (3, 3, '2023-04-03', 3),
    (4, 4, '2023-04-04', 1),
    (5, 5, '2023-04-05', 5),
    (6, 6, '2023-04-06', 2),
    (7, 7, '2023-04-07', 1),
    (8, 8, '2023-04-08', 1),
    (9, 9, '2023-04-09', 1),
    (10, 10, '2023-04-10', 4);